# Задание 2. Форма ввода этапов развития человека
print("Введите по порядку этапы развития человека:")
stage1 = input("Стадия 1: ")
stage2 = input("Стадия 2: ")
stage3 = input("Стадия 3: ")
stage4 = input("Стадия 4: ")
stage5 = input("Стадия 5: ")
stage6 = input("Стадия 6 (последняя): ")

print(stage1, stage2, stage3, stage4, stage5, stage6, sep=' => ')
