# Задание 1. Ввод-вывод и базовые переменные
# Бэкенд ветеринарной клиники — вывод информации о питомце
pet_type = input("Введите вид питомца: ")
pet_name = input("Введите кличку питомца: ")
pet_age = input("Введите возраст питомца (например, 34 года): ")

print(f'Это {pet_type} по кличке "{pet_name}". Возраст: {pet_age}.')
