# Задание 1. Палиндром
s = input("Введите строку без пробелов: ")
if s == s[::-1]:
    print("yes")
else:
    print("no")
