# Задание 1. Площадь и периметр прямоугольника
a = float(input("Введите сторону A: "))
b = float(input("Введите сторону B: "))
area = a * b
perimeter = 2 * (a + b)
print("Площадь:", area)
print("Периметр:", perimeter)
